---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.TaperedWallAnglesControlledByType
source: html/8fcee92d-96fc-ac1b-bca4-d630951a9c1a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.TaperedWallAnglesControlledByType Property

Cannot set angles on a tapered wall which has angles controlled by the type.

## Syntax (C#)
```csharp
public static FailureDefinitionId TaperedWallAnglesControlledByType { get; }
```